/*1.  დაწერეთ ფუნქცია, რომელიც გაუცვლის მნიშვნელობებს 2 სიმბოლოს.
 გამოიყენეთ ფუნქცია ძირითად პროგრამაში და შედეგი დაბეჭდეთ.*/

/*2.  დაწერეთ ფუნქცია, რომელიც გაუცვლის მნიშვნელობებს 2 სტრიქონს. 
გამოიყენეთ ფუნქცია ძირითად პროგრამაში და დაალაგეთ ზრდადობით 3 მოცემული სტრიქონი. შედეგი დაბეჭდეთ.*/

/*3.  ვექტორი შეიცავს N მთელ შემთხვევით რიცხვს. დაწერეთ პროგრამა, რომელიც იპოვის და       
      დაბეჭდავს ვექტორის:
 ა)   უდიდესი ელემენტის მნიშვნელობას და მის ინდექსს; 
 ბ)   ელემენტების ჯამს;
 გ)   ელემენტების საშუალო არითმეტიკულს;
დ)   ელემენტების საშუალო გეომეტრიულს.*/

/*4.  ვექტორი შეიცავს N მთელ რიცხვს. დაწერეთ პროგრამა, რომელიც იპოვის და დაბეჭდავს:
  ა. მოცემული ვექტორის b რიცხვის ტოლი პირველივე ელემენტის ინდექსს, ან, თუ ასეთი ელემენტი არ აღმოჩნდა, ვექტორის ზომას. 
  ბ.  მოცემული ვექტორის b რიცხვის ტოლი ბოლო ელემენტის ინდექსს, ან, თუ ასეთი ელემენტი არ აღმოჩნდა, ვექტორის ზომას. 
ვექტორი შეავსეთ შემთხვევითი რიცხვებით, b შემოიტანეთ კლავიატურიდან.*/

/*5. words.in ფაილი შეიცავს ჰარის სიმბოლოთი გამოყოფილ სიტყვებს. დაწერეთ ფუნქცია, 
რომელიც დაადგენს, არის თუ არა ფაილში სიტყვა exam. თუ ეს სიტყვა ფაილში არის, ფუნქციამ
 უნდა დააბრუნოს მისი რიგითი ნომერი, თუ კი არაა – დააბრუნოს -1. გამოიყენეთ ფუნქცია პროგრამაში და დაბეჭდეთ სათანადო გზავნილი. */

/*6)შექმენით და main()–ში გამოიყენეთ ფუნქცია, რომელიც პარამეტრად მიიღებს 2 ნამდვილი რიცხვის მისამართს და 
გაუცვლის მათ მნიშვნელობებს, თუ პირველი მეტია მეორეზე (ანუ დაახარისხებს ზრდადობით).*/
/*7)შექმენით და main()–ში გამოიყენეთ ფუნქცია, რომელიც პარამეტრად მიიღებს 3 ნამდვილი რიცხვის მისამართს, 
პირველ რიცხვში მოათავსებს ამ რიცხვებიდან, მინიმალურს, მეორეში-საშუალოს, მესამეში-უდიდესს. */

/*8)დაწერეთ ფუნქცია, რომელიც პარამეტრად  მიიღებს სტრინგების ვექტორის მისამართს და იმ ფაილის სახელს, 
საიდანაც უნდა დაამატოს ელემენტები მოცემულ ვექტორში. გამოიყენეთ ფუნქცია main()–ში. ვექტორში ჩაწერეთ რამდენიმე 
სიტყვა, ხოლო დანარჩენი სიტყვები, თქვენი ფუნქციის გამოყენებით,  დაამატეთ data.txt ფაილიდან.
ლაბორატორიული მეცადინეობის ამოცანა 3 გადაწერეთ ისე, რომ:
ა).  out ფუნქციამ დაბეჭდოს ვექტორის ელემენტები k სვეტად, სადაც k წარმოადგენს ფუნქციის მეორე პარამეტრს;
ბ). შესაძლებელი გახდეს names.txt ფაილში ნებისმიერი სახელის ჩანაცვლება სხვა სახელით. 
შექმენით ფუნქცია, რომელიც ნამდვილი რიცხვების ვექტორში იპოვის და დააბრუნებს                    
20-ზე მეტი რიცხვებიდან უდიდესის ინდექსს. გამოიყენეთ ფუნქცია main-ში 55 შემთხვევითი ნამდვილი რიცხვისათვის დიაპაზონიდან [ 15., 60.5].
*/