// 6.4 შექმენით Random Walk რიცხვით ღერძზე.
// მოძრაობას იწყებს 0 წერტილიდან:
// -1 - მოძრაობა მარცხნივ
// 0 - იგივე ადგილზე დარჩენა
// 1 - მოძრაობა მარჯვნივ
// საერთო ჯამში გავაკეთებინოთ 5 ნაბიჯი და ვნახოთ ამ ოთხი ნაბიჯის შემდეგ რომელ წერტილზე იქნება. დაითვალეთ თითოეულ პოზიციაზე ყოფნის ალბათობები 5 სვლის შემდეგ.
// გამოიყენეთ პოინტერები ან/და რეფერენსები. შექმენით საჭირო ფუნქციები და მასივები გადაეცით ფუნქციის არგუმენტებად.  ყურადღება მიაქციეთ const და non-const პარამეტრებს. სადაც მხოლოდ წაკითხვა გჭირდებათ, მიუთითეთ const.

